<html>	
	<head>
		  <title>
		  		 Lier une Dll &agrave; LuaEdit (Tutoriel) - Et c'est un D&eacute;part!
		  </title>
	</head>

	<body bgcolor="#FFFFFF" vlink="silver" alink="navy" link="navy">
		 <table width="100%" border="0" cellpadding="0" cellspacing="0" summary="">
				<tr> 
					<td valign="bottom">													  
						<div align="left">
							<b><font face="Tahoma" size="3" color="navy">Et c'est un D&eacute;part!</font></b>
						</div>	
					</td> 
					<td>
						<font face="Tahoma" size="1" color="silver">  
						<div align="right" valign="top">
							 <a href="http://www.lua.org">Page d'accueuil Lua</a>
						</div>	
						</font>
					</td>
				</tr>
				<tr valign="top">
					<td colspan="2">
						  <hr size="1" color="#000000">
						  <br>
						  <br>
						  <font face="Tahoma" size="2">
						  <p style="text-align:justify">
						  	Tout d'abord, t&eacute;l&eacute;chargez LuaEdit <a href="http://luaforge.net/frs/?group_id=84&release_id=318">ici</a>,
							installez-le et d&eacute;marrez-le. (Si LuaEdit est d&eacute;j&agrave; install&eacute;, il est inutile de le ret&eacute;l&eacute;charger et r&eacute;installer)
							Ensuite, on doit cr&eacute;er un nouveau project qui contiendra une script lua.
							Une fois le project cr&eacute;&eacute;, sauvegardez-le sous [Tutoriel]\Bin\Simon.lpr et sauvegardez la script lua
							sous [Tutoriel]\Bin\Simon.lua o&ugrave; [Tutoriel] repr&eacute;sente le chemin o&ugrave; vous avez d&eacute;zipp&eacute; le tutoriel.
							On se doit de le faire ainsi afin d'utiliser la propri&eacute;t&eacute; "Initializer". Cette propri&eacute;t&eacute;
							est en fait le chemin complet d'une dll qui DOIT exporter une fonction suivant le prototype suivant:
							
							<ul type="square"> 
							  <li>Delphi: <b style="color: navy">&nbsp;LuaDebug_Initializer(L: PLua_State): Integer; cdecl;&nbsp;</b></li>
							  <li>C/C++: <b style="color: navy">&nbsp;int LuaDebug_Initializer(lua_State *L);&nbsp;</b></li>
							</ul>
										   
							Cette fonction sera appel&eacute;e juste avant l'ex&eacute;cution de la script et peut &ecirc;tre utilis&eacute;e
							pour diff&eacute;rente raison d'un projet &agrave; l'autre. En d'autre mots, ceci se trouve &agrave; &ecirc;tre une fonction "call back" dans laquel vous
							pouvez fair pratiquement quoi que soit d'utile avec/sans l'environnement Lua avant l'ex&eacute;cution d'une script Lua.
							Seul les scripts lua contenue dans un projet peuvent b&eacute;n&eacute;ficier de la propri&eacute;t&eacute; "Initializer"
							&eacute;tant donn&eacute; le fait que celle-ci n'est disponible que dans les options d'un projet.	Dans ce tutoriel, nous 
							assignerons le chemin complet du fichier [Tutorial]\Bin\simon.dll. Cette dll exporte d&eacute;j&agrave; la fonction discut&eacute; plus haut
							pour enregister des fonctions dans l'environnement Lua. Une fois cette propri&eacute;t&eacute; ajust&eacute;, sauvegardez le projet
							et commencons &agrave; parler de code!
							<br>
							<br>
							<br>
							<b>Conseils:</b>
							<ul type="square">						 
								<li>Pour cr&eacute;er un projet, cliquez sur le menu Files/New/Project</li>
								<li>Si vous ne trouvez pas la fen&ecirc;tre "Project Tree", c'est peut-&ecirc;tre parce qu'elle.
									est cach&eacute;e. Pour l'afficher, cliquez sur le menu View/Project Tree.</li>
								<li>Pour ajuster la propri&eacute;t&eacute; "Initializer" d'un projet, appliquez un cliquer droit sur celui-ci
									et cliquez sur le menu Project Settings. Dans cette bo&icirc;te de dialogue
									selectionnez le tabulateur Debug. Specifiez le chemin complet de la dll en question
									et appuyez sur Ok lorsque termin&eacute;.</li>
								<li>Vous voulez peut-&ecirc;tre changer le nom du projet pour l'apperler "Simon".
									Changer cette propri&eacute;t&eacute; n'a aucun effet sur le comportement du code Lua
									mais peut &ecirc;tre utile pour se retrouver dans l'interface de LuaEdit.</li>
							</ul>
						  </p>
						  <br> 
						  </font>
					</td>
				</tr> 
				<tr> 
					<td valign="bottom">													  
						<font face="Tahoma" size="2">
						<div align="left" valign="bottom">
							<a href=".\Intro_Fr.html">&lt;&lt; Pr&eacute;c&eacute;dent</a>
						</div>	
					</td> 
					<td>   
						<font face="Tahoma" size="2">
						<div align="right" valign="bottom">
                             <a href=".\Page2_Fr.html">Suivant &gt;&gt;</a>
						</div>	
						</font>
					</td>
				</tr>
				<tr>
					<td colspan="2">
						<font face="Tahoma" size="1" color="silver">
						<hr size="1" color="#000000">
							<div align="right">			  
								<a href="http://www.luaedit.org">www.luaedit.org</a>
								<br>
								&copy; Copyright 2004-2005 LuaEdit
								<br>
								Lier une Dll &agrave; LuaEdit (Tutoriel)
							</div>
						</font>
					</td>
				</tr>
		  </table>
	</body>
</html>
