<html>	
	<head>
		  <title>
		  		 Lier une Dll &agrave; LuaEdit (Tutoriel) - G&eacute;rer le Jeu
		  </title>	
		  <link rel="stylesheet" href="..\Tutorial.css" type="text/css">
	</head>

	<body bgcolor="#FFFFFF" vlink="silver" alink="navy" link="navy">
		 <table width="100%" border="0" cellpadding="0" cellspacing="0" summary="">
				<tr> 
					<td valign="bottom">													  
						<div align="left">
							<b><font face="Tahoma" size="3" color="navy">G&eacute;rer le Jeu</font></b>
						</div>	
					</td> 
					<td>
						<font face="Tahoma" size="1" color="silver">  
						<div align="right" valign="top">
							 <a href="http://www.lua.org">Page d'accueuil Lua</a>
						</div>	
						</font>
					</td>
				</tr>
				<tr valign="top">
					<td colspan="2">
						  <hr size="1" color="#000000">
						  <br>
						  <br>
						  <font face="Tahoma" size="2">
						  <p style="text-align:justify">
							Maintenant, la script contient de solides bases/structures autour desquelles nous allons
							ajouter du code pour g&eacute;rer le jeu. Cela signifie algorythmes de g&eacute;n&eacute;ration al&eacute;atoire de s&eacute;quence,
							validations de touche, syst&egrave;me de pointage, etc. Commencons par la routine d'intialisation du jeu.
						  </p>
						  <br> 
						  </font>
					</td>
				</tr> 
				<tr>
					<td colspan="2"> 	
						  <font face="Tahoma" size="2">	
						  <p style="text-align:justify"> 
						  	La fonction simon:Initialize() pr&eacute;c&eacute;demment ajout&eacute;e sera appel&eacute; juste avant chaque nouvelle partie
							requise par le joueur. Notre but principal dans cette fonction est de r&eacute;initialiser tout les variables de manipulation
							pr&eacute;c&eacute;demment cr&eacute;&eacute;es et initialiser la logique de hasard. Dans le monde des ordinateurs, g&eacute;n&eacute;rer
							le hasard est loin d'&ecirc;tre une mince chose &agrave; accomplir. Soyons r&eacute;alistes, il est impossible de recr&eacute;er
							exactement ce que le hasard est par d&eacute;finition. D'un autre c&ocirc;t&eacute;, nous pouvons g&eacute;n&eacute;rer quelque chose
							de si grand en termes de quantit&eacute; de possibilit&eacute;s, que statistiquement et humainement parlant, nous pouvons
							appeler cela du hasard. Le moteur de pseudo-hasard de Lua fonctionne de la m&ecirc;me mani&egrave;re que celui du C/C++.
							En fait, "derri&egrave;re la sc&egrave;ne", Lua utilise le moteur de pseudo-harsard du C/C++. Ce moteur fonctionne
							avec des "seeds" (semances) pour g&eacute;n&eacute;rer des s&eacute;quences de num&eacute;ros au "hasard". Une "seed" (semance) est un nombre qui sera
							utilis&eacute; pour g&eacute;n&eacute;rer les num&eacute;ros au "hasard". En d'autre mots, deux s&eacute;quences utilisant la m&ecirc;me "seed" (semance)
							sera identique. Pour &eacute;viter ce probl&egrave;me, plusieurs scripts/programmes utilisent l'heure courrante du syst&egrave;me
							comme "seed" (semance), ce qui rend pratiquement impossible pour l'utilisateur d'obetenir ou m&ecirc;me de se rappeler
							d'avoir obetenue la m&ecirc;me s&eacute;quence. Voici comment la fonction simon:Initialize() devrait ressembler &agrave;:
						  </p> 
						  <br>
					</td>
				</tr>
				<tr>
					<td class="code" colspan="2">
						<br>
						<blockquote>
							-- Initialize the game<br>
							function simon:Initialize()<br>
								&nbsp;&nbsp;&nbsp;&nbsp;-- Initalize variables<br>
								&nbsp;&nbsp;&nbsp;&nbsp;simon:SetScore(0)<br>
								&nbsp;&nbsp;&nbsp;&nbsp;GameState = true<br>
								&nbsp;&nbsp;&nbsp;&nbsp;UserSequenceCount = 0<br>
								&nbsp;&nbsp;&nbsp;&nbsp;SequenceCount = 0<br>
								&nbsp;&nbsp;&nbsp;&nbsp;MainSequence = {}<br><br>
								
								&nbsp;&nbsp;&nbsp;&nbsp;-- Initialize random engine<br>
								&nbsp;&nbsp;&nbsp;&nbsp;math.randomseed(os.time())<br>
								&nbsp;&nbsp;&nbsp;&nbsp;math.random()<br>
								&nbsp;&nbsp;&nbsp;&nbsp;math.random()<br>
								&nbsp;&nbsp;&nbsp;&nbsp;math.random()<br>
							end<br>
						</blockquote>
					</td>						  
				</tr> 
				<tr>
					<td colspan="2"> 	
						  <font face="Tahoma" size="2">
						  <br>
						  <br>	
						  <p style="text-align:justify"> 
						  	Dans le pr&eacute;c&eacute;dent exemple de code, la fonction math.random() est appel&eacute;e par trois fois parce que sur certains
							syst&egrave;me d'exploitation (du moins dans Windows 2k<sup>&reg;</sup>) les premiers num&eacute;ros d'une s&eacute;quence de hasard que vous obtenez ne sont pas r&eacute;ellement
							"hasard&eacute;s". (Source prise du site web <a href="http://lua-users.org/wiki/MathLibraryTutorial">lua-users wiki</a>) Pour obtenir de meilleur pseudo-hasardeux num&eacute;ros, nous avons juste &agrave; g&eacute;n&eacute;rer quelques num&eacute;ros au hasard
							avant de r&eacute;ellement les utiliser. Les autre lignes de code dans le pr&eacute;c&eacute;dent exemple initialise les variables pr&eacute;c&eacute;demment
							d&eacute;clar&eacute;es &agrave; <a href=".\Page2_En.html">l'&eacute;tape 2</a> de ce tutoriel. Maintenant, ajoutons du code &agrave; la
							fonction simon:AddSequence(Sequence). Le but de cette fonction est d'ajouter un nouvel item &agrave; s&eacute;quence
							principale que le joueur essaira de reproduire plus tard. Pour se faire, nous incr&eacute;menterons par 1
							la variable globale SequenceCount et nous "hasarderons" un num&eacute;ro de 1 &agrave; 4. Le num&eacute;ro g&eacute;n&eacute;r&eacute;
							repr&eacute;sentera une des lumi&egrave;re &agrave; allumer dans la s&eacute;quence. Voici &agrave; quoi la fonction devrait ressembler &agrave;:
						  </p> 
						  <br>
					</td>
				</tr>  
				<tr>
					<td class="code" colspan="2">
						<br>
						<blockquote>
							-- Add one more part to the game's sequence<br>
							function simon:AddSequence()<br>
								&nbsp;&nbsp;&nbsp;&nbsp;SequenceCount = SequenceCount + 1<br>
							    &nbsp;&nbsp;&nbsp;&nbsp;MainSequence[SequenceCount] = math.random(4)<br>
							end<br>
						</blockquote>
					</td>						  
				</tr> 
				<tr>
					<td colspan="2"> 	
						  <font face="Tahoma" size="2">
						  <br>
						  <br>	
						  <p style="text-align:justify"> 
						  	 Maintenant, remplissons la fonction simon:PlaySequence(Sequence). Le principal obectif de cette
							 fonction est de jouer une s&eacute;quence pr&eacute;c&eacute;demment b&acirc;tit par l'interm&eacute;diaire de fonctions export&eacute;es du
							 moteur du jeu Simon<sup>&reg;</sup>. Dans cette fonction, on devrait analyser la table de la s&eacute;quence principale
							 item par item et allumet la lumi&egrave;re qui correspond avec la valeur de l'item courrant.
							 Soyons un peu plus sp&eacute;cifique:
						  </p> 
						  <br>
					</td>
				</tr> 
				<tr>
					<td class="code" colspan="2">
						<br>
						<blockquote>
							-- Play the game's sequence<br>
							function simon:PlaySequence(Sequence)<br>
								&nbsp;&nbsp;&nbsp;&nbsp;local v = nil<br>
								&nbsp;&nbsp;&nbsp;&nbsp;local i = nil<br><br>
								
								&nbsp;&nbsp;&nbsp;&nbsp;-- Lock controls from user to make sure no conflicts happened while palying sequence<br>
								&nbsp;&nbsp;&nbsp;&nbsp;simon.LockControls()<br><br>
								
								&nbsp;&nbsp;&nbsp;&nbsp;-- Play all sequence<br>
							    &nbsp;&nbsp;&nbsp;&nbsp;repeat<br>
							    	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;simon.SetLight(SIMON_NONE)<br>
							    	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sleep(300)<br>
									&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;i, v = next(Sequence, i)<br>
									&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;simon.SetLight(v)<br><br>
							
									&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;if i ~= nil then<br>
										&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sleep(500)<br>
									&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;end<br>
							    &nbsp;&nbsp;&nbsp;&nbsp;until i == nil<br><br>
							    
							    &nbsp;&nbsp;&nbsp;&nbsp;simon.UnlockControls()<br>
							    &nbsp;&nbsp;&nbsp;&nbsp;simon.SetLight(SIMON_NONE)<br>
							end<br>
						</blockquote>
					</td>						  
				</tr>  
				<tr>
					<td colspan="2"> 	
						  <font face="Tahoma" size="2">
						  <br>
						  <br>	
						  <p style="text-align:justify"> 
						  	 Les deux variables locales v et i serons utilis&eacute;es pour r&eacute;cup&eacute;rer le r&eacute;sultat
							 du retour aux appels &agrave; la fonction next(). La fonction next() sert &agrave; obtenir l'item
							 suivant l'&eacute;l&eacute;ment donn&eacute; dans une table Lua en passant celle-ci et l'index de
							 l'&eacute;l&eacute;ment courrant comme arguments. Les fonctions simon.LockControls() et simon.UnlockControls()
							 sont export&eacute;es du moteur du jeu leur but principal est de verrouiller/d&eacute;verrouiller
							 les contr&ocirc;les au joueur afin d'&eacute;viter toute conflit dans le code. Dans le pr&eacute;c&eacute;dent exemple
							 de code, ces appels effectu&eacute;s avant et apr&egrave;s la boucle qui s'occupe d'afficher la s&eacute;quence
							 au joueur &agrave; l'&eacute;cran. Aussi, la l'exemple de code, l'instruction repeat...until
							 a &eacute;t&eacute; utilis&eacute; afin de permettre au code d'entrer dans la bouvle &agrave; la premi&egrave;re it&eacute;ration
							 chaque fois qu'il le doit mais n'importe quel autre syntaxe de boucle aurait tr&egrave;s bien pu faire l'affaire.
							 Le premier morceau de code dans la boucle principale est un appel &agrave; la fonction simon.SetLight() utilisant
							 SIMON_NONE comme premier et seul argument. Cette instruction fermera tout les lumi&egrave;res
							 dans le jeu parce que nous voulons nous assurer que pour chaque item il n'y aille pas d'autre lumi&egrave;re allum&eacute;e
							 que celle repr&eacute;senter par l'item courrant. Ensuite, nous avons un appel &agrave; la fonction Sleep() avec 300 miliseconds
							 comme argument. Cet appel, contrairement &agrave; celui &agrave; <a href=".\Page2_En.html">l'&eacute;tape 2</a> du
							 tutoriel, a le m&ecirc;me effet sur le processeur de l'ordinateur mais est davantage utilis&eacute; dans ce cas-ci comme un dispositif de "pause"
							 plut&ocirc;t qu'un dispositif de "rallentissement". Avec ce qui a &eacute;t&eacute; clarifi&eacute; jusqu'&agrave; maintenant,
							 vous devriez &ecirc;tre capable de comprendre les lignes de code qui n'ont toujours pas &eacute;t&eacute; expliqu&eacute;es.
						  </p> 
						  <p style="text-align:justify"> 
						  	 Afin de finaliser cette &eacute;tape, nous allons ajouter un peu de code &agrave; la fonction simon:OnButtonClick(ButtonIndex).
							 Cette fonction sera apell&eacute;e depuis le moteur du jeu Simon<sup>&reg;</sup> &agrave; chaque fois que
							 le joueur appuira sur un des quatre bouttons du jeu. Notre but principal dans cette fonction
							 est de valider les boutton que le joueur &agrave; appuy&eacute; et commencer &agrave; g&eacute;rer le syst&egrave;me de pointage pour une &eacute;ventuelle victoire.
							 Pour se faire, les fonctions simon.GetScore() et simon.SetScore() seront utilis&eacute;es. &Eacute;tant donn&eacute; la
							 simplicit&eacute; de cette fonction et l'avancement du tutoriel, cette fonction ne sera pas
							 expliqu&eacute; en d&eacute;tail. Vous avez juste &agrave; vous rappeler de ce que nous avons discut&eacute; jusqu'&agrave; maintenant dans ce turoriel:
						  </p> 
						  <br>
					</td>
				</tr>
				<tr>
					<td class="code" colspan="2">
						<br>
						<blockquote>
							-- Event handler called by simon.dll when any of the colored buttons are clicked<br>
							function simon:OnButtonClick(ButtonIndex)<br>
								&nbsp;&nbsp;&nbsp;&nbsp;local Result = 0<br>
								&nbsp;&nbsp;&nbsp;&nbsp;UserSequenceCount = UserSequenceCount + 1<br><br>
								
								&nbsp;&nbsp;&nbsp;&nbsp;if MainSequence[UserSequenceCount] == ButtonIndex then<br>
									&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;simon.SetScore(simon.GetScore() + 10)<br>
								    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Result = 1<br>
								&nbsp;&nbsp;&nbsp;&nbsp;end<br><br>
								
								&nbsp;&nbsp;&nbsp;&nbsp;return Result<br>
							end<br>
						</blockquote>
					</td>						  
				</tr>  
				<tr>
					<td colspan="2"> 	
						  <font face="Tahoma" size="2">
						  <br>
						  <br>	
						  <p style="text-align:justify"> 
						  	 Dans la prochaine &eacute;tape de ce tutoriel, nous discuterons davantage &agrave; propos du "contr&ocirc;le" du jeu
							 dans la boucle principale et lier les fonctions de la dll C/C++/Delphi.
						  </p> 
						  <br>
					</td>
				</tr> 
				<tr> 
					<td valign="bottom">													  
						<font face="Tahoma" size="2">
						<div align="left" valign="bottom">
							<a href=".\Page2_Fr.html">&lt;&lt; Pr&eacute;c&eacute;dent</a>
						</div>	
					</td> 
					<td>   
						<font face="Tahoma" size="2">
						<div align="right" valign="bottom">
                             <a href=".\Page4_Fr.html">Suivant &gt;&gt;</a>
						</div>	
						</font>
					</td>
				</tr>
				<tr>
					<td colspan="2">
						<font face="Tahoma" size="1" color="silver">
						<hr size="1" color="#000000">
							<div align="right">			  
								<a href="http://www.luaedit.org">www.luaedit.org</a>
								<br>
								&copy; Copyright 2004-2005 LuaEdit
								<br>
								Lier une Dll &agrave; LuaEdit (Tutoriel)
							</div>
						</font>
					</td>
				</tr>
		  </table>
	</body>
</html>
