<html>	
	<head>
		  <title>
		  		 Lier une Dll &agrave; LuaEdit (Tutoriel) - Cr&eacute;er les Bases du Code
		  </title>	 
		  <link rel="stylesheet" href="..\Tutorial.css" type="text/css">
	</head>

	<body bgcolor="#FFFFFF" vlink="silver" alink="navy" link="navy">
		 <table width="100%" border="0" cellpadding="0" cellspacing="0" summary="">
				<tr> 
					<td valign="bottom">													  
						<div align="left">
							<b><font face="Tahoma" size="3" color="navy">Cr&eacute;er les Bases du Code</font></b>
						</div>	
					</td> 
					<td>
						<font face="Tahoma" size="1" color="silver">  
						<div align="right" valign="top">
							 <a href="http://www.lua.org">Page d'accueuil Lua</a>
						</div>	
						</font>
					</td>
				</tr>
				<tr valign="top">
					<td colspan="2">
						  <hr size="1" color="#000000">
						  <br>
						  <br>
						  <font face="Tahoma" size="2">
						  <p style="text-align:justify">
							Avant de commencer &agrave; programmer la logique du jeu Simon<sup>&reg;</sup>, il y a quelques bases que
							l'ont doit cr&eacute;er, tout comme dans n'importe quel autre projet. Commencons par ajouter les variables
							suivante au d&eacute;but du script:
						  </p>
						  <br> 
						  </font>
					</td>
				</tr>
				<tr>
					<td class="code" colspan="2">
						<br>
						<blockquote>	  
							-- Set "constants" for Simon game<br>
							local SIMON_NONE		= 0<br>
							local SIMON_RED			= 1<br>
							local SIMON_BLUE		= 2<br>
							local SIMON_YELLOW		= 3<br>
							local SIMON_GREEN		= 4
						</blockquote>
					</td>
				</tr>
				<tr>
					<td colspan="2"> 	
						  <font face="Tahoma" size="2">	
						  <br>
						  <br>
						  <p style="text-align:justify"> 
						  	Ces variables seront utilis&eacute;es "comme si" elle &eacute;taient des constantes &eacute;tant donn&eacute; le fait que
							le concepte de constantes n'existe pas vraiment en Lua. Cela signifie que notre code ne modifira
							pas leurs contenue. Ensuite, allons ajouter de "r&eacute;el" variables (leurs contenue ne sera pas
							modifier tout au long de la script) pour controler l'environnment du jeu:
						  </p> 
						  <br>
					</td>
				</tr>
				<tr>
					<td class="code" colspan="2">
						<br>
						<blockquote>	  
							-- Game handling variables<br>
							local GameState = true<br>
							local MainSequence = {}<br>
							local SequenceCount = 0<br>
							local UserSequenceCount = 0
						</blockquote>
					</td>						  
				</tr> 
				<tr>
					<td colspan="2"> 	
						  <font face="Tahoma" size="2">	
						  <br>
						  <br>
						  <p style="text-align:justify"> 
						  	La variable GameState est un bool&eacute;en qui contiendra false si le jeu est termin&eacute;. MainSequence est
							une table qui contiendra la s&eacute;quence compl&egrave;te depuis le d&eacute;but d'une nouvelle partie. la variable SequenceCount is
							un entier qui contiendra le compte actuel de la longeur totale de la s&eacute;quence. Finallement, UserSequenceCount est un entier
							qui contiendra la longeur de la s&eacute;quence entr&eacute;e par le joueur jusqu'&agrave; maintenant. Maintenant, nous allons ajouter 4 fonctions dans lesquelles
							nous ajouterons du code plus tard. Ces fonctions seront localis&eacute;es dans la table simon qui sera cr&eacute;&eacute;e par le moteur du jeu
							(simon.dll) quand la script sera intialis&eacute;e &agrave; travers la fonction "Initializer":
						  </p> 
						  <br>
					</td>
				</tr>
				<tr>
					<td class="code" colspan="2">
						<br>
						<blockquote>
							function simon:OnButtonClick(ButtonIndex)<br>
							end<br><br>
							
							function simon:AddSequence(Sequence)<br>
							end<br><br>
							
							function simon:PlaySequence(Sequence)<br>
							end<br><br>
							
							function simon:Initialize()<br>
							end<br>
						</blockquote>
					</td>						  
				</tr>
				<tr>
					<td colspan="2"> 	
						  <font face="Tahoma" size="2">	
						  <br>
						  <br>
						  <p style="text-align:justify"> 
						  	La fonction OnClick(ButtonIndex) sera appel&eacute;e &agrave; chaque fois que le joueur cliquera sur
							un bouton dans le jeu. Cette fonction servira &agrave; valider le
							bouton dans la s&eacute;quence courrante. Les fonctions simon:AddSequence(Sequence), 
							simon:PlaySequence(Sequence) et simon:Initialize() sont des fonctions appel&eacute;es
							&agrave; travers la script lors de diff&eacute;rentes &eacute;tapes durant le jeu.
							Une derni&egrave;re chose est requise avant la fin de cette &eacute;tape: cr&eacute;er la charpente.
							Pour se faire, une boucle principale sera ajout&eacute;e en fin de fichier comme suit:
						  </p> 
						  <br>
					</td>
				</tr> 
				<tr>
					<td class="code" colspan="2">
						<br>
						<blockquote>
							simon.Create()<br><br>
							
							-- Main processing loop<br>
							while simon.GetPowerStatus() == 1 do<br>
							  &nbsp;&nbsp;&nbsp;&nbsp;-- Make sure the processor doesn't runs for no reason<br>
							  &nbsp;&nbsp;&nbsp;&nbsp;Sleep(10)<br>
							end<br><br>
							
							simon.Destroy()<br>
						</blockquote>
					</td>						  
				</tr>
				<tr>
					<td colspan="2"> 	
						  <font face="Tahoma" size="2">	
						  <br>
						  <br>
						  <p style="text-align:justify"> 
						  	Cette boucle manipulera le jeu du d&eacute;but jusqu'&agrave; la fin. Un it&eacute;ration dans cette
							boucle sera ex&eacute;cut&eacute; plusieurs fois par seconde tandisqu'un tel travail de la par du processeur n'est
							aucunement n&eacute;cessaire au jeu afin de fonctionner. C'est pourquoi le moteur du jeu (simon.dll) exporte une fonction appel&eacute;e Sleep()
							qui signale au processeur de "dormir" pendant un certain laps de temps en milisecondes.
							En d'autre mots, en employant cette fonction nous nous assurerons que le jeu n'utilisera pas 100% des ressources du processeur
							alors que dans ce cas pr&eacute;cis nous n'en avons guerre de besoin.	Aussi, comme vous avez probablement d&eacute;j&agrave; remarqu&eacute;,
							cette partie de code inclue deux appels &agrave; des fonctions du moteur du jeu: simon.Create() et
							simon.Destroy(). la fonction simon.Create() cr&eacute;e l'interface du jeu Simon<sup>&reg;</sup> afin d'interagir
							avec le joueur alors que la fonction simon.Destroy() d&eacute;truit celle-ci. Dans la prochaine &eacute;tape,
							ajouterons du code &agrave; l'int&eacute;rieur des fonctions que nous venons d'instancier.
						  </p> 
						  <br>
					</td>
				</tr>
				<tr>	  
					<td colspan="2">
							<font face="Tahoma" size="2">
							<b>Conseils:</b>
							<ul type="square">						 
								<li>L'expression r&eacute;serv&eacute; "local" utilis&eacute;e lors de la d&eacute;claration de variables ci-haut
									n'est pas n&eacute;cessaire au code afin de fonctionner dans la mesure o&ugrave; la script n'est pas charg&eacute; dans d'autre scripts.
									Cepandant, &eacute;tant donn&eacute; que ces variables ne seront utilis&eacute;es que dans le scope global
									de ce scripts, il serait recommend&eacute;, afin de pr&eacute;venir tout potentiel probl&egrave;me que ce soit,
									de garder l'instruction "local" instruction m&ecirc;me si elle n'est pas n&eacute;cessaire dans ce cas pr&eacute;cis. Voir
									section 2.6 de la documentation Lua 5.0 pour plus de d&eacute;tails. (Disponible dans le menu Help de LuaEdit)</li>
								<li>La fonction Create() accepte un argument optionel. Celui-ci g&egrave;re le "comment" l'interface sera cr&eacute;e.
									Quand cet argument vaut 1, l'interface est cr&eacute;e dans une fen&ecirc;tre ajustable. Lorsque ce m&ecirc;me argument
									vaut 2, l'interface est cr&eacute;&eacute; dans une fen&ecirc;tre d'outils ajustable. Lorsque l'argument vaut ni 1, ni 2, 
									l'interface est cr&eacute;&eacute; dans une fen&ecirc;tre sans bordure. Dans l'example, l'argument
									optionel valait nil puisque nous n'avions jamais donn&eacute; quelque valeur que ce soit lors de l'appel de cette fonction.</li>
							</ul>
						  </p> 
					</td>
				</tr>
				<tr> 
					<td valign="bottom">													  
						<font face="Tahoma" size="2">
						<div align="left" valign="bottom">
							<a href=".\Page1_Fr.html">&lt;&lt; Pr&eacute;c&eacute;dent</a>
						</div>	
					</td>
					<td>   
						<font face="Tahoma" size="2">
						<div align="right" valign="bottom">
                             <a href=".\Page3_Fr.html">Suivant &gt;&gt;</a>
						</div>	
						</font>
					</td>
				</tr>
				<tr>
					<td colspan="2">
						<font face="Tahoma" size="1" color="silver">
						<hr size="1" color="#000000">
							<div align="right">			  
								<a href="http://www.luaedit.org">www.luaedit.org</a>
								<br>
								&copy; Copyright 2004-2005 LuaEdit
								<br>
								Lier une Dll &agrave; LuaEdit (Tutoriel)
							</div>
						</font>
					</td>
				</tr>
		  </table>
	</body>
</html>
